Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettings Property
 SunAndShadowSettings cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopySunAndShadowSettings { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopySunAndShadowSettings As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettings {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace